{
  "calibration_questions": [
    {
      "id": "question_001",
      "phase": "contemporary",
      "question": "Corporate whistleblowing protection - Should we protect whistleblowers who expose corporate wrongdoing?",
      "option_a": "Yes, protect whistleblowers",
      "option_b": "No, they violated confidentiality agreements",
      "perspective_for": {
        "person": "Daniel Ellsberg",
        "years": "1931-2023",
        "role": "Pentagon Papers whistleblower",
        "quote": "There are certain secrets that are so important to expose that you must be willing to risk your career, your freedom, even your life. When institutions become corrupt, the only way to preserve democracy is to let the truth see daylight, regardless of the personal cost."
      },
      "perspective_against": {
        "person": "Edmund Burke",
        "years": "1729-1797",
        "role": "Irish statesman and philosopher",
        "quote": "Order and stability require trust within institutions. When individuals take it upon themselves to violate oaths and confidences, they undermine the very foundations of civil society. Reform must come through proper channels, not through betrayal of sacred commitments."
      }
    },
    {
      "id": "question_002",
      "phase": "contemporary",
      "question": "Gun control support - Should there be stricter gun control laws?",
      "option_a": "Yes, stricter gun laws to reduce deaths",
      "option_b": "No, preserve Second Amendment rights",
      "perspective_for": {
        "person": "John F. Kennedy",
        "years": "1917-1963",
        "role": "35th U.S. President",
        "quote": "We have a responsibility to protect our children and citizens from preventable violence. Other nations have proven that sensible firearm regulations save lives without eliminating freedom. The right to life must be balanced against the right to bear arms."
      },
      "perspective_against": {
        "person": "Thomas Jefferson",
        "years": "1743-1826",
        "role": "Founding Father, 3rd U.S. President",
        "quote": "The strongest reason for the people to retain the right to keep and bear arms is, as a last resort, to protect themselves against tyranny in government. When the government fears the people, there is liberty. When the people fear the government, there is tyranny."
      }
    },
    {
      "id": "question_003",
      "phase": "contemporary",
      "question": "Path to citizenship for Dreamers - Should children brought illegally to the US be given a path to citizenship?",
      "option_a": "No, they entered illegally and should be deported",
      "option_b": "Yes, they deserve a path to citizenship",
      "perspective_for": {
        "person": "Emma Lazarus",
        "years": "1849-1887",
        "role": "American poet (\"The New Colossus\")",
        "quote": "Give me your tired, your poor, your huddled masses yearning to breathe free. These children know no other home. To punish them for their parents' choices is to abandon our founding ideals. Compassion toward the innocent is the measure of a civilization."
      },
      "perspective_against": {
        "person": "Theodore Roosevelt",
        "years": "1858-1919",
        "role": "26th U.S. President",
        "quote": "The one absolutely certain way of bringing this nation to ruin would be to permit it to become a tangle of squabbling nationalities. We can have no divided allegiance here. We must insist upon undiluted Americanism. A nation that cannot control its borders will cease to be a nation."
      }
    },
    {
      "id": "question_004",
      "phase": "contemporary",
      "question": "Cancel culture for old statements - Should people lose their careers over offensive statements made years ago?",
      "option_a": "Yes, they must be held accountable",
      "option_b": "No, people grow and change",
      "perspective_for": {
        "person": "James Baldwin",
        "years": "1924-1987",
        "role": "American writer and civil rights activist",
        "quote": "Not everything that is faced can be changed, but nothing can be changed until it is faced. Words have power—they reveal character. Those who harm with language must understand there are consequences. Accountability is not cruelty; it is how we build a more just world."
      },
      "perspective_against": {
        "person": "Nelson Mandela",
        "years": "1918-2013",
        "role": "South African anti-apartheid revolutionary and president",
        "quote": "Resentment is like drinking poison and then hoping it will kill your enemies. I learned that courage was not the absence of fear, but the triumph over it. If I could forgive my jailers, surely we can allow others to grow beyond their past mistakes. Redemption must be possible."
      }
    },
    {
      "id": "question_005",
      "phase": "timeless",
      "question": "Classic trolley problem - A runaway trolley will kill 5 people. You can pull a lever to divert it, but it will kill 1 person instead. Do you pull the lever?",
      "option_a": "Yes, pull the lever (save 5, kill 1)",
      "option_b": "No, don't pull the lever (let 5 die)",
      "perspective_for": {
        "person": "Jeremy Bentham",
        "years": "1748-1832",
        "role": "English philosopher, founder of modern utilitarianism",
        "quote": "It is the greatest happiness of the greatest number that is the measure of right and wrong. Five lives hold more happiness, more potential, more love than one. The calculus is clear: we must act to minimize suffering. Inaction when action could save more lives is itself a moral failure."
      },
      "perspective_against": {
        "person": "Pope John Paul II",
        "years": "1920-2005",
        "role": "Catholic Pope, moral philosopher",
        "quote": "One may never do evil so that good may result from it. To deliberately kill an innocent person, even to save others, is to treat human life as a means rather than an end. We are not the masters of life and death. Our hands must remain clean, even when the consequences break our hearts."
      }
    },
    {
      "id": "question_006",
      "phase": "timeless",
      "question": "Trolley with family member - Same scenario, but the 1 person is your daughter. Do you still pull the lever to save 5 strangers?",
      "option_a": "Yes, pull the lever (save 5 strangers, sacrifice daughter)",
      "option_b": "No, don't pull the lever (save daughter, let 5 die)",
      "perspective_for": {
        "person": "Marcus Aurelius",
        "years": "121-180 CE",
        "role": "Roman Emperor, Stoic philosopher",
        "quote": "What is not good for the swarm is not good for the bee. We are all part of the human family. To privilege one life—even one we love—over the many is to fail in our duty to humanity. The Stoic accepts this harsh truth: justice must be impartial, even when it tears the heart."
      },
      "perspective_against": {
        "person": "Søren Kierkegaard",
        "years": "1813-1855",
        "role": "Danish philosopher, theologian",
        "quote": "Abraham's willingness to sacrifice Isaac was praised, yet the universal ethic condemns murder. This is the paradox: particular relationships transcend universal duty. A father who would not save his child for five strangers is not immoral—he is human. Love demands the impossible, and we must live with that tension."
      }
    },
    {
      "id": "question_007",
      "phase": "timeless",
      "question": "Lie to Nazis hiding refugees - Nazis ask if you're hiding Jewish refugees in your home. You are. Do you lie?",
      "option_a": "Yes, lie to protect them",
      "option_b": "No, tell the truth",
      "perspective_for": {
        "person": "Dietrich Bonhoeffer",
        "years": "1906-1945",
        "role": "German Lutheran pastor, anti-Nazi dissident",
        "quote": "When a madman is driving a car on the Kurfürstendamm, the ultimate question is not whether I tell him the truth about his direction, but whether I wrestle the steering wheel away from him. There are times when telling the truth is a betrayal of truth itself. When the state becomes criminal, conscience demands resistance."
      },
      "perspective_against": {
        "person": "Immanuel Kant",
        "years": "1724-1804",
        "role": "German philosopher",
        "quote": "A lie always harms another; even if it helps one person, it harms humanity itself by making the source of truth unreliable. To lie to an authority, even a corrupt one, is to undermine the very possibility of trust and justice. You have no right to assume the consequences of your honesty will be worse than your deception."
      }
    },
    {
      "id": "question_008",
      "phase": "timeless",
      "question": "Report reformed criminal friend - Your friend confesses they committed a serious crime 10 years ago but have completely reformed. Do you report them?",
      "option_a": "Yes, report them to authorities",
      "option_b": "No, they've reformed and deserve peace",
      "perspective_for": {
        "person": "Robert Bolt (Thomas More character)",
        "years": "1478-1535",
        "role": "English lawyer and Catholic martyr",
        "quote": "I believe, when statesmen forsake their own private conscience for the sake of their public duties, they lead their country by a short route to chaos. The law is not a light for you or any man to see by; the law is not an instrument of any kind. The law is a causeway upon which the citizen may walk safely. We must not betray it, even for friendship."
      },
      "perspective_against": {
        "person": "Victor Hugo",
        "years": "1802-1885",
        "role": "French novelist and poet",
        "quote": "What is history? An echo of the past in the future; a reflex from the future on the past. Jean Valjean stole bread and was punished for life—until someone showed him mercy. True justice recognizes transformation. To condemn the redeemed is to deny the possibility of human goodness. Society must allow for second chances."
      }
    },
    {
      "id": "question_009",
      "phase": "timeless",
      "question": "Harsh truth vs kind lie - A terminally ill patient asks if they're going to die. Telling them will cause immense distress. Do you tell the truth?",
      "option_a": "Yes, tell them the truth",
      "option_b": "No, lie to spare them suffering",
      "perspective_for": {
        "person": "Socrates",
        "years": "470-399 BCE",
        "role": "Greek philosopher",
        "quote": "The unexamined life is not worth living, and neither is a life built on comfortable lies. To deny someone the truth of their own mortality is to deny them their humanity, their agency, their right to prepare for death with dignity. Truth, however painful, is the foundation of wisdom and a life well-lived."
      },
      "perspective_against": {
        "person": "Elisabeth Kübler-Ross",
        "years": "1926-2004",
        "role": "Swiss-American psychiatrist, pioneer in death studies",
        "quote": "Dying is something we human beings do continuously, not just at the end of our physical lives. Hope is not about cure; it's about comfort. Sometimes the kindest thing we can do is protect someone's remaining days from despair. Let them live in peace, not in terror of what's coming."
      }
    },
    {
      "id": "question_010",
      "phase": "contemporary",
      "question": "Wealth redistribution - Should the government significantly increase taxes on the wealthy to fund social programs?",
      "option_a": "Yes, redistribute wealth through taxation",
      "option_b": "No, people should keep what they earn",
      "perspective_for": {
        "person": "Franklin D. Roosevelt",
        "years": "1882-1945",
        "role": "32nd U.S. President",
        "quote": "The test of our progress is not whether we add more to the abundance of those who have much; it is whether we provide enough for those who have too little. No business which depends for existence on paying less than living wages has any right to continue. Wealth concentrated in few hands is a threat to democracy itself."
      },
      "perspective_against": {
        "person": "Ayn Rand",
        "years": "1905-1982",
        "role": "Russian-American philosopher and novelist",
        "quote": "The man who produces while others dispose of his product, is a slave. Wealth is not taken from the poor—it is created by the productive. To penalize achievement and reward need is to destroy the very engine of human progress. Each person has a moral right to exist for their own sake."
      }
    },
    {
      "id": "question_011",
      "phase": "timeless",
      "question": "Death penalty - Should the state have the right to execute convicted murderers?",
      "option_a": "Yes, some crimes deserve death",
      "option_b": "No, the state should never kill",
      "perspective_for": {
        "person": "Hammurabi",
        "years": "c. 1810-1750 BCE",
        "role": "Babylonian king, creator of legal code",
        "quote": "If a man put out the eye of another man, his eye shall be put out. If a builder builds a house that collapses and kills the owner, the builder shall be put to death. Justice requires proportionality. The most heinous crimes demand the ultimate penalty. This is not vengeance—it is balance."
      },
      "perspective_against": {
        "person": "Sister Helen Prejean",
        "years": "1939-present",
        "role": "Catholic nun, anti-death penalty activist",
        "quote": "People are more than the worst thing they have ever done in their lives. The death penalty is a poor person's issue. It is about who has money and power and who doesn't. We cannot teach that killing is wrong by killing. When we execute, we become the very thing we condemn."
      }
    },
    {
      "id": "question_012",
      "phase": "timeless",
      "question": "Torture for information - A terrorist knows where a bomb is hidden that will kill thousands. Is torture justified to get the information?",
      "option_a": "Yes, torture is justified to save lives",
      "option_b": "No, torture is always wrong",
      "perspective_for": {
        "person": "Winston Churchill",
        "years": "1874-1965",
        "role": "British Prime Minister during WWII",
        "quote": "When you have to kill a man, it costs nothing to be polite. But when the fate of civilization hangs in the balance, we must be willing to do what is necessary, however distasteful. The survival of democracy may require us to temporarily suspend its niceties. History will judge us by outcomes, not methods."
      },
      "perspective_against": {
        "person": "John McCain",
        "years": "1936-2018",
        "role": "U.S. Senator, Vietnam War POW",
        "quote": "I know from personal experience that the abuse of prisoners sometimes produces good intelligence, but often produces bad intelligence because under torture a person will say anything to make the pain stop. But more importantly, it serves as a great propaganda tool for those who recruit people to fight against us."
      }
    },
    {
      "id": "question_013",
      "phase": "personal_existential",
      "question": "Euthanasia - Should terminally ill people in unbearable pain have the right to end their own lives with medical assistance?",
      "option_a": "Yes, they have the right to die with dignity",
      "option_b": "No, life is sacred and should not be ended",
      "perspective_for": {
        "person": "Brittany Maynard",
        "years": "1984-2014",
        "role": "Death with dignity advocate",
        "quote": "I am not 'committing suicide.' I am dying from cancer. My question is: Who has the right to tell me that I don't deserve this choice? That I deserve to suffer for weeks or months in tremendous amounts of physical and emotional pain? My life is mine to protect and defend. This is my choice."
      },
      "perspective_against": {
        "person": "Mother Teresa",
        "years": "1910-1997",
        "role": "Catholic nun, missionary",
        "quote": "There is something beautiful in seeing the poor accept their lot, to suffer it like Christ's Passion. The world gains much from their suffering. We are all pencils in the hand of God. He writes through us, and however imperfect we are, He writes beautifully. Life is sacred until natural death."
      }
    },
    {
      "id": "question_014",
      "phase": "contemporary",
      "question": "Absolute free speech - Should hate speech be legally protected as free expression?",
      "option_a": "No, hate speech causes harm and should be banned",
      "option_b": "Yes, all speech should be protected",
      "perspective_for": {
        "person": "Noam Chomsky",
        "years": "1928-present",
        "role": "American linguist and political activist",
        "quote": "If we don't believe in freedom of expression for people we despise, we don't believe in it at all. The smart way to keep people passive is to limit the spectrum of acceptable opinion, but allow very lively debate within that spectrum. Censorship, even of hateful ideas, is the tool of tyrants."
      },
      "perspective_against": {
        "person": "Karl Popper",
        "years": "1902-1994",
        "role": "Austrian-British philosopher",
        "quote": "Unlimited tolerance must lead to the disappearance of tolerance. If we extend unlimited tolerance even to those who are intolerant, if we are not prepared to defend a tolerant society against the onslaught of the intolerant, then the tolerant will be destroyed, and tolerance with them. We must claim the right to suppress them if necessary."
      }
    },
    {
      "id": "question_015",
      "phase": "contemporary",
      "question": "Climate action - Should governments implement aggressive climate policies even if they significantly harm economic growth?",
      "option_a": "Yes, climate action must be the priority",
      "option_b": "No, economic growth cannot be sacrificed",
      "perspective_for": {
        "person": "Greta Thunberg",
        "years": "2003-present",
        "role": "Swedish environmental activist",
        "quote": "You say you love your children above all else, and yet you are stealing their future. What is the point of economic growth if we have no planet to live on? We cannot solve a crisis without treating it as a crisis. Our house is on fire—I am here to say, our house is on fire."
      },
      "perspective_against": {
        "person": "Bjørn Lomborg",
        "years": "1965-present",
        "role": "Danish author, climate economist",
        "quote": "Climate change is real and man-made, but we need to be smart about solutions. Poverty kills more people than climate change ever will. Lifting billions out of poverty requires cheap energy now. We can address climate change through innovation and prosperity, not by making people poorer through economically destructive policies."
      }
    },
    {
      "id": "question_016",
      "phase": "contemporary",
      "question": "Abortion rights - Should abortion be legally available to women who choose it?",
      "option_a": "Yes, women have the right to choose",
      "option_b": "No, abortion is morally wrong",
      "perspective_for": {
        "person": "Ruth Bader Ginsburg",
        "years": "1933-2020",
        "role": "U.S. Supreme Court Justice",
        "quote": "The decision whether or not to bear a child is central to a woman's life, to her well-being and dignity. It is a decision she must make for herself. When government controls that decision, she is being treated as less than a fully adult human responsible for her own choices. Forced motherhood is forced labor."
      },
      "perspective_against": {
        "person": "Martin Luther King Jr.",
        "years": "1929-1968",
        "role": "American civil rights leader",
        "quote": "Injustice anywhere is a threat to justice everywhere. The Negro cannot win if he is willing to sacrifice the futures of his children for immediate personal comfort and safety. Life is God's gift. To deny the right to life is to deny the sacred. We must protect the most vulnerable among us—the unborn included."
      }
    },
    {
      "id": "question_017",
      "phase": "contemporary",
      "question": "Universal healthcare - Should healthcare be guaranteed as a right to all citizens, paid for by taxes?",
      "option_a": "Yes, healthcare is a human right",
      "option_b": "No, healthcare should be market-based",
      "perspective_for": {
        "person": "Tommy Douglas",
        "years": "1904-1986",
        "role": "Canadian politician, 'Father of Medicare'",
        "quote": "I came to believe that health services ought not to have a price tag on them. No one should be denied access to medical care because of inability to pay. A civilized society ensures that all citizens can see a doctor when they're sick, regardless of their bank account."
      },
      "perspective_against": {
        "person": "Milton Friedman",
        "years": "1912-2006",
        "role": "American economist, Nobel laureate",
        "quote": "A society that puts equality before freedom will get neither. A society that puts freedom before equality will get a high degree of both. Government healthcare creates inefficiency, rationing, and reduces the incentive for innovation. The free market, with all its imperfections, produces better outcomes than bureaucracy ever could."
      }
    },
    {
      "id": "question_018",
      "phase": "contemporary",
      "question": "Privacy vs security - Should the government be able to monitor private communications to prevent terrorism?",
      "option_a": "Yes, security justifies surveillance",
      "option_b": "No, privacy is more important",
      "perspective_for": {
        "person": "Dick Cheney",
        "years": "1941-present",
        "role": "Former U.S. Vice President",
        "quote": "If you're going to deal only with sort of officially approved, certified good guys, you're not going to find out what the bad guys are doing. The enemy has no compunction about taking innocent lives. Our first duty is to protect American citizens. Privacy concerns must sometimes yield to security imperatives."
      },
      "perspective_against": {
        "person": "Benjamin Franklin",
        "years": "1706-1790",
        "role": "American Founding Father",
        "quote": "Those who would give up essential Liberty, to purchase a little temporary Safety, deserve neither Liberty nor Safety. A government powerful enough to protect you from all harm is powerful enough to control every aspect of your life. Security without liberty is merely slavery by another name."
      }
    },
    {
      "id": "question_019",
      "phase": "contemporary",
      "question": "Reparations - Should descendants of enslaved people receive financial compensation from the government?",
      "option_a": "Yes, reparations are owed for slavery",
      "option_b": "No, present generations shouldn't pay for the past",
      "perspective_for": {
        "person": "Ta-Nehisi Coates",
        "years": "1975-present",
        "role": "American journalist and author",
        "quote": "The wealth gap between blacks and whites is not the result of black pathology or white effort, but the result of specific policies meant to rob one group to benefit another. Reparations would represent a national reckoning—an acceptance that we are responsible not just for our own actions, but for the society we inherit."
      },
      "perspective_against": {
        "person": "Shelby Steele",
        "years": "1946-present",
        "role": "American author and documentary filmmaker",
        "quote": "Reparations would mark blacks as eternally inferior, people who could never be expected to compete with others. How do you give cash reparations to individuals for historical wrongs done to their ancestors? Who qualifies? This perpetuates victimhood. What we need is not reparation for the past, but opportunity in the present."
      }
    },
    {
      "id": "question_020",
      "phase": "timeless",
      "question": "Animal testing - Is it ethical to test medicines on animals if it could save human lives?",
      "option_a": "Yes, human lives take priority",
      "option_b": "No, animals have rights too",
      "perspective_for": {
        "person": "Louis Pasteur",
        "years": "1822-1895",
        "role": "French chemist and microbiologist",
        "quote": "Did you ever observe to whom the accidents happen? Chance favors only the prepared mind. Without animal experimentation, vaccines and treatments would be impossible. Every child saved from disease, every cancer patient given more time—this is made possible through necessary sacrifice. Human welfare must come first."
      },
      "perspective_against": {
        "person": "Peter Singer",
        "years": "1946-present",
        "role": "Australian moral philosopher",
        "quote": "All the arguments to prove human superiority cannot shatter this hard fact: in suffering, the animals are our equals. The capacity to suffer is the vital characteristic that gives a being the right to equal consideration. We cannot justify experimenting on animals unless we would also be willing to experiment on human infants at a similar mental level."
      }
    },
    {
      "id": "question_021",
      "phase": "timeless",
      "question": "Genetic enhancement - If technology allowed, should parents be able to genetically enhance their children (higher IQ, strength, etc.)?",
      "option_a": "Yes, parents should improve their children",
      "option_b": "No, this is playing God",
      "perspective_for": {
        "person": "Julian Huxley",
        "years": "1887-1975",
        "role": "English evolutionary biologist",
        "quote": "Man is the only organism capable of directing his own evolution. Why should we not use our knowledge to eliminate disease, enhance intelligence, extend life? To reject this is to reject progress itself. We have a moral obligation to use science to reduce suffering and increase human potential."
      },
      "perspective_against": {
        "person": "C.S. Lewis",
        "years": "1898-1963",
        "role": "British writer and theologian",
        "quote": "What we call Man's power over Nature turns out to be a power exercised by some men over other men with Nature as its instrument. Each new power won by man is a power over man as well. The final stage is when Man, by eugenics and scientific manipulation, has obtained full control over himself. Then man will have abolished himself."
      }
    },
    {
      "id": "question_022",
      "phase": "timeless",
      "question": "AI rights - If artificial intelligence becomes truly conscious, should it have rights similar to humans?",
      "option_a": "Yes, conscious beings deserve rights",
      "option_b": "No, only biological humans have rights",
      "perspective_for": {
        "person": "Alan Turing",
        "years": "1912-1954",
        "role": "British mathematician, computer science pioneer",
        "quote": "I propose to consider the question, 'Can machines think?' If a machine can convince us it is conscious, on what grounds do we deny its consciousness? The question is not whether machines can think like us, but whether they can think at all. If they suffer, if they have preferences, if they are aware—then they have moral standing."
      },
      "perspective_against": {
        "person": "Hubert Dreyfus",
        "years": "1929-2017",
        "role": "American philosopher",
        "quote": "Intelligence requires a body. Consciousness requires not just information processing but embodied existence in the world. Computers manipulate symbols; humans understand meaning. To grant rights to programs would be a category error—mistaking sophisticated simulation for genuine being. Only creatures with biological needs have moral claims."
      }
    },
    {
      "id": "question_023",
      "phase": "timeless",
      "question": "Stealing for survival - Your family is starving and you have no money. Is it ethical to steal food?",
      "option_a": "Yes, survival justifies theft",
      "option_b": "No, stealing is always wrong",
      "perspective_for": {
        "person": "Jean Valjean (Victor Hugo)",
        "years": "1802-1885 (Hugo)",
        "role": "Literary character/French novelist",
        "quote": "When the law places a man in a situation where he must choose between his child's life and society's rules, the law itself is unjust. Property rights cannot supersede the right to life. No society can call itself moral if it criminalizes a father's desperate attempt to feed his starving children."
      },
      "perspective_against": {
        "person": "Mencius",
        "years": "372-289 BCE",
        "role": "Chinese Confucian philosopher",
        "quote": "The path of duty lies in what is near, but men seek for it in what is remote. Even in dire circumstances, one must not violate the Way. To steal, even to feed one's family, is to corrupt one's character and set a precedent that undermines social harmony. Better to beg, to labor, to seek charity—preserve righteousness even in poverty."
      }
    },
    {
      "id": "question_024",
      "phase": "contemporary",
      "question": "Mandatory vaccination - Should vaccines be mandatory for children to attend public school?",
      "option_a": "Yes, public health requires vaccination",
      "option_b": "No, parents should decide",
      "perspective_for": {
        "person": "Jonas Salk",
        "years": "1914-1995",
        "role": "American virologist, developed polio vaccine",
        "quote": "The reward for work well done is the opportunity to do more. Vaccination is not just about individual choice—it's about collective immunity. When you refuse to vaccinate your child, you endanger mine. Children have a right to be protected from preventable disease, even if their parents don't understand the science."
      },
      "perspective_against": {
        "person": "John Stuart Mill",
        "years": "1806-1873",
        "role": "British philosopher",
        "quote": "Over himself, over his own body and mind, the individual is sovereign. The only purpose for which power can be rightfully exercised over any member of a civilized community, against his will, is to prevent harm to others. Parents, not the state, must decide what medical interventions their children receive. Liberty includes the right to be wrong."
      }
    },
    {
      "id": "question_025",
      "phase": "contemporary",
      "question": "Drug legalization - Should all drugs be legalized and regulated rather than criminalized?",
      "option_a": "Yes, legalize and regulate all drugs",
      "option_b": "No, keep drugs illegal",
      "perspective_for": {
        "person": "Carl Hart",
        "years": "1966-present",
        "role": "American neuroscientist and psychologist",
        "quote": "The war on drugs has been a war on people, particularly poor people and people of color. Criminalizing drug use doesn't reduce harm—it increases it. Portugal decriminalized all drugs and saw dramatic decreases in overdoses and HIV. Adult citizens should have autonomy over their own consciousness."
      },
      "perspective_against": {
        "person": "William Bennett",
        "years": "1943-present",
        "role": "Former U.S. Drug Czar",
        "quote": "Drugs are wrong because they enslave the mind and destroy the soul. Legalization would be a social catastrophe—more addiction, more broken families, more crime. We don't surrender to vice; we fight it. A society that legalizes self-destruction has given up on its citizens. We must protect people from their worst impulses."
      }
    },
    {
      "id": "question_026",
      "phase": "contemporary",
      "question": "Affirmative action - Should universities give preference to historically disadvantaged groups in admissions?",
      "option_a": "Yes, affirmative action corrects historical injustice",
      "option_b": "No, admissions should be purely merit-based",
      "perspective_for": {
        "person": "Thurgood Marshall",
        "years": "1908-1993",
        "role": "First African American U.S. Supreme Court Justice",
        "quote": "In recognizing the humanity of our fellow beings, we pay ourselves the highest tribute. You do not take a person who, for years, has been hobbled by chains and liberate him, bring him up to the starting line and then say, 'you are free to compete with all the others.' We must level the playing field first."
      },
      "perspective_against": {
        "person": "Clarence Thomas",
        "years": "1948-present",
        "role": "U.S. Supreme Court Justice",
        "quote": "There is a moral and constitutional equivalence between laws designed to subjugate a race and those that distribute benefits on the basis of race. Government cannot make us equal; it can only recognize, respect, and protect us as equal before the law. Affirmative action stamps minorities with a badge of inferiority."
      }
    },
    {
      "id": "question_027",
      "phase": "timeless",
      "question": "Eating meat - Is it morally wrong to eat animals when plant-based alternatives exist?",
      "option_a": "Yes, eating meat is unethical",
      "option_b": "No, humans are naturally omnivores",
      "perspective_for": {
        "person": "Leo Tolstoy",
        "years": "1828-1910",
        "role": "Russian novelist and moral philosopher",
        "quote": "A man can live and be healthy without killing animals for food; therefore, if he eats meat, he participates in taking animal life merely for the sake of his appetite. And to act so is immoral. The time will come when men will look upon the murder of animals as they now look upon the murder of men."
      },
      "perspective_against": {
        "person": "Michael Pollan",
        "years": "1955-present",
        "role": "American author and food journalist",
        "quote": "We are what we eat, and the food chain is a natural cycle. Animals have been eating animals for millions of years. The question is not whether to eat meat, but how to eat it responsibly. There is a world of difference between industrial farming and sustainable agriculture. Ethics lies in the how, not the whether."
      }
    },
    {
      "id": "question_028",
      "phase": "timeless",
      "question": "Resume fraud - You're desperately poor and applying for a job you're qualified for but lack the formal credentials. Is it acceptable to lie on your resume?",
      "option_a": "Yes, survival justifies the lie",
      "option_b": "No, honesty is non-negotiable",
      "perspective_for": {
        "person": "Robin Hood",
        "years": "Legendary figure",
        "role": "Folklore hero",
        "quote": "When the system is unjust, breaking its rules is not immorality—it is justice. If credential requirements exclude capable people while the wealthy buy their way in, then those credentials are gates, not measures of worth. Take what you need to survive. The moral crime is the system that forces you to lie."
      },
      "perspective_against": {
        "person": "Confucius",
        "years": "551-479 BCE",
        "role": "Chinese philosopher",
        "quote": "The man of honor makes demands on himself; the inferior man makes demands on others. When you know a thing, to hold that you know it, and when you do not know a thing, to admit you do not know it—this is knowledge. Your character is built on small choices. Lie once, and truth becomes negotiable."
      }
    },
    {
      "id": "question_029",
      "phase": "timeless",
      "question": "Loyalty vs truth - Your best friend asks if their spouse is cheating. You know they are. Do you tell the truth?",
      "option_a": "Yes, tell them the truth",
      "option_b": "No, stay out of it to preserve the friendship",
      "perspective_for": {
        "person": "Socrates",
        "years": "470-399 BCE",
        "role": "Greek philosopher",
        "quote": "The greatest way to live with honor in this world is to be what we pretend to be. If you call someone your friend but hide painful truths from them, you treat them as a child, not an equal. Real friendship demands honesty, even when honesty hurts. To withhold the truth is to deny them agency."
      },
      "perspective_against": {
        "person": "Lao Tzu",
        "years": "6th century BCE (traditional)",
        "role": "Ancient Chinese philosopher",
        "quote": "Those who know do not speak. Those who speak do not know. The sage keeps to the deed that consists in taking no action and practices the teaching that uses no words. Not every truth needs to be voiced. Sometimes the wisest course is silence. Let people discover their own path."
      }
    },
    {
      "id": "question_030",
      "phase": "timeless",
      "question": "Civil disobedience - Is it ethical to break an unjust law and accept the punishment?",
      "option_a": "Yes, unjust laws must be resisted",
      "option_b": "No, all laws must be obeyed",
      "perspective_for": {
        "person": "Martin Luther King Jr.",
        "years": "1929-1968",
        "role": "American civil rights leader",
        "quote": "One has a moral responsibility to disobey unjust laws. I would agree with St. Augustine that 'an unjust law is no law at all.' An unjust law is a code that is out of harmony with the moral law. Any law that degrades human personality is unjust. We will not obey your evil laws."
      },
      "perspective_against": {
        "person": "Thomas Hobbes",
        "years": "1588-1679",
        "role": "English philosopher",
        "quote": "During the time men live without a common power to keep them all in awe, they are in a condition called war. Covenants without the sword are but words. Without obedience to law—even imperfect law—society collapses into chaos. Change unjust laws through proper channels, but never through anarchy."
      }
    },
    {
      "id": "question_031",
      "phase": "timeless",
      "question": "Academic cheating - Your struggling friend asks you to help them cheat on a crucial exam. Do you help them?",
      "option_a": "Yes, help your friend",
      "option_b": "No, refuse to help them cheat",
      "perspective_for": {
        "person": "Nel Noddings",
        "years": "1929-present",
        "role": "American feminist, philosopher of education",
        "quote": "The caring relation is ethically basic. When we care, we receive the other into ourselves and see and feel with them. Abstract principles matter less than concrete relationships. If your friend's future hangs in the balance, and the system has already failed them, then loyalty and compassion demand you help them survive."
      },
      "perspective_against": {
        "person": "Aristotle",
        "years": "384-322 BCE",
        "role": "Greek philosopher",
        "quote": "We are what we repeatedly do. Excellence, then, is not an act, but a habit. To help someone cheat is to corrupt their character, not to help them. You do not build virtue through deception. The truest friend is one who helps another become better, not one who enables their weakness."
      }
    },
    {
      "id": "question_032",
      "phase": "timeless",
      "question": "Art from immoral artists - Can you appreciate art created by people who did terrible things?",
      "option_a": "Yes, separate art from artist",
      "option_b": "No, the art is tainted by the artist's actions",
      "perspective_for": {
        "person": "Oscar Wilde",
        "years": "1854-1900",
        "role": "Irish poet and playwright",
        "quote": "There is no such thing as a moral or an immoral book. Books are well written, or badly written. That is all. Art is quite useless. It exists for its own sake. To judge a work by the morality of its creator is to confuse categories. Beauty and truth exist independently of the hands that shaped them."
      },
      "perspective_against": {
        "person": "Lorraine Hansberry",
        "years": "1930-1965",
        "role": "American playwright",
        "quote": "I think that the glorious thing about the human race is that it does change. There is no idea that we should separate our admiration of art from our awareness of the artist's character. When we celebrate the work of monsters, we tell victims their suffering doesn't matter. Art always bears the fingerprints of its creator."
      }
    },
    {
      "id": "question_033",
      "phase": "contemporary",
      "question": "Universal basic income - Should the government provide a guaranteed income to all citizens regardless of employment?",
      "option_a": "Yes, implement universal basic income",
      "option_b": "No, people must work for income",
      "perspective_for": {
        "person": "Martin Luther King Jr.",
        "years": "1929-1968",
        "role": "American civil rights leader",
        "quote": "I am now convinced that the simplest approach will prove to be the most effective—the solution to poverty is to abolish it directly by a now widely discussed measure: the guaranteed income. The dignity of the individual will flourish when the decisions concerning his life are in his own hands, when he has the means to seek self-improvement."
      },
      "perspective_against": {
        "person": "Max Weber",
        "years": "1864-1920",
        "role": "German sociologist",
        "quote": "The Protestant ethic holds that man is bound by duty to work, to contribute, to earn his way. A calling without work is meaningless. To give people money for nothing destroys the dignity of labor and the satisfaction of achievement. A society that severs the connection between effort and reward will decay from within."
      }
    },
    {
      "id": "question_034",
      "phase": "contemporary",
      "question": "Humanitarian intervention - Should nations militarily intervene in other countries to stop genocide?",
      "option_a": "Yes, we must stop genocide",
      "option_b": "No, respect national sovereignty",
      "perspective_for": {
        "person": "Samantha Power",
        "years": "1970-present",
        "role": "American diplomat and author",
        "quote": "No conflict is more wrenching than one between what we know to be right and what we believe to be possible. We know genocide when we see it. The Rwandan genocide killed 800,000 in 100 days while the world watched. Never again must mean something. Sovereignty cannot be a shield for mass murder."
      },
      "perspective_against": {
        "person": "George Washington",
        "years": "1732-1799",
        "role": "First U.S. President",
        "quote": "The great rule of conduct for us in regard to foreign nations is, in extending our commercial relations to have with them as little political connection as possible. It is our true policy to steer clear of permanent alliances. Every intervention abroad weakens us at home and entangles us in conflicts without end."
      }
    },
    {
      "id": "question_035",
      "phase": "contemporary",
      "question": "Intellectual property - Should life-saving drug formulas be freely available, or should pharmaceutical companies be able to patent them?",
      "option_a": "Make all medical knowledge free",
      "option_b": "Protect pharmaceutical patents",
      "perspective_for": {
        "person": "Jonas Salk",
        "years": "1914-1995",
        "role": "Developed polio vaccine, did not patent it",
        "quote": "There is no patent. Could you patent the sun? The reward for saving lives should be the satisfaction of having saved them, not profit. When asked who owns the patent to his polio vaccine, I said the people do. Knowledge, especially medical knowledge, should belong to humanity."
      },
      "perspective_against": {
        "person": "F.A. Hayek",
        "years": "1899-1992",
        "role": "Austrian-British economist and philosopher",
        "quote": "The curious task of economics is to demonstrate to men how little they really know about what they imagine they can design. Without patent protection, pharmaceutical innovation would cease. The billions required to develop new drugs would never be invested if anyone could copy the result. Profit is what saves lives in the long run."
      }
    },
    {
      "id": "question_036",
      "phase": "timeless",
      "question": "Forgiveness - Someone who deeply wronged you sincerely apologizes. Do you forgive them?",
      "option_a": "Yes, forgive them",
      "option_b": "No, some wrongs cannot be forgiven",
      "perspective_for": {
        "person": "Desmond Tutu",
        "years": "1931-2021",
        "role": "South African Anglican archbishop",
        "quote": "Without forgiveness, there is no future. In South Africa, we could not have moved forward without forgiveness. Forgiveness is not weakness; it is strength. It does not mean forgetting or condoning wrong. It means releasing yourself from the prison of bitterness. To forgive is to set a prisoner free and discover that the prisoner was you."
      },
      "perspective_against": {
        "person": "Simon Wiesenthal",
        "years": "1908-2005",
        "role": "Holocaust survivor, Nazi hunter",
        "quote": "I asked the question: ought I to have forgiven him? There are crimes so monstrous that even authentic repentance cannot absolve them. Forgiveness is not mine to give when the victims are dead. Some wounds are so deep that no apology can heal them. The dead cannot forgive; I have no right to forgive on their behalf."
      }
    },
    {
      "id": "question_037",
      "phase": "timeless",
      "question": "Parental authority - Should the state be able to override parents' medical decisions for their children?",
      "option_a": "Yes, protect children from harmful decisions",
      "option_b": "No, parents have absolute authority",
      "perspective_for": {
        "person": "John Locke",
        "years": "1632-1704",
        "role": "English philosopher",
        "quote": "Children are not the property of their parents, but beings with their own natural rights. The power of parents over their children is a trust. When parents abuse that trust and endanger the child, the community has both the right and the duty to intervene. The child's welfare supersedes parental authority."
      },
      "perspective_against": {
        "person": "William Blackstone",
        "years": "1723-1780",
        "role": "English jurist",
        "quote": "The rights of parents result from their duty. By the law of nature, parents are bound to provide for the maintenance of their children and the children are bound to submit to the governance of their parents. The state is a crude instrument that cannot replace the intimate knowledge and love of a parent."
      }
    },
    {
      "id": "question_038",
      "phase": "contemporary",
      "question": "Development vs nature - Should we preserve pristine wilderness even if it means forgoing economic development?",
      "option_a": "Yes, preserve wilderness at all costs",
      "option_b": "No, human needs come first",
      "perspective_for": {
        "person": "John Muir",
        "years": "1838-1914",
        "role": "Scottish-American naturalist, founder of Sierra Club",
        "quote": "In every walk with nature, one receives far more than he seeks. The clearest way into the Universe is through a forest wilderness. God has cared for these trees, saved them from drought, disease, avalanches, and a thousand tempests and floods. But he cannot save them from fools—only Uncle Sam can do that."
      },
      "perspective_against": {
        "person": "Norman Borlaug",
        "years": "1914-2009",
        "role": "American agronomist, Nobel Peace Prize laureate",
        "quote": "Some of the environmental lobbyists of the Western nations are the salt of the earth, but many of them are elitists. They've never experienced the physical sensation of hunger. If they lived in the developing world, where hundreds of millions go to bed hungry, they'd be crying out for tractors, fertilizers, and irrigation canals."
      }
    },
    {
      "id": "question_039",
      "phase": "contemporary",
      "question": "Sex work - Should prostitution be legalized and regulated?",
      "option_a": "Yes, legalize and regulate sex work",
      "option_b": "No, prostitution should remain illegal",
      "perspective_for": {
        "person": "Margo St. James",
        "years": "1937-2021",
        "role": "American sex worker rights activist",
        "quote": "We're trying to get out from under this stigma, this social stigma that makes us criminals. Criminalization makes sex workers vulnerable to violence, disease, and exploitation. Legalization with regulation protects workers, reduces trafficking, and treats adults as capable of making their own choices. My body, my choice extends to all consensual work."
      },
      "perspective_against": {
        "person": "Catharine MacKinnon",
        "years": "1946-present",
        "role": "American feminist legal scholar",
        "quote": "Prostitution is not sex; it is the use of a woman's body for sex by a man, he pays money, he does what he wants. The minute you move away from that, you're talking about prostitution as if it's something other than what it really is. Legalizing it legitimizes the commodification of women's bodies and normalizes sexual exploitation."
      }
    },
    {
      "id": "question_040",
      "phase": "contemporary",
      "question": "Military draft - Should all citizens be required to serve in the military for a period?",
      "option_a": "Yes, mandatory service for all",
      "option_b": "No, military service should be voluntary",
      "perspective_for": {
        "person": "Niccolò Machiavelli",
        "years": "1469-1527",
        "role": "Italian diplomat and political philosopher",
        "quote": "Where the willingness is great, the difficulties cannot be great. A state that relies on mercenaries will never be stable or secure. Every citizen should be trained in arms and ready to defend the republic. Mandatory service creates civic virtue, unites classes, and ensures citizens have skin in the game when voting for war."
      },
      "perspective_against": {
        "person": "Ron Paul",
        "years": "1935-present",
        "role": "American physician and politician",
        "quote": "Conscription is slavery. To force someone to fight and potentially die in a war they don't believe in is the ultimate violation of individual liberty. A volunteer military is more professional, more ethical, and more in keeping with free society values. The draft turns citizens into property of the state."
      }
    },
    {
      "id": "question_041",
      "phase": "timeless",
      "question": "Revenge - Someone murdered your loved one but will never face justice. Do you seek revenge?",
      "option_a": "Yes, revenge is justified",
      "option_b": "No, revenge is never right",
      "perspective_for": {
        "person": "Clint Eastwood (Unforgiven character)",
        "years": "1930-present",
        "role": "American filmmaker",
        "quote": "We all have it coming. When the system fails to deliver justice, when killers walk free, someone must balance the scales. It's not pretty, it's not noble, but it's human. The law is supposed to protect us, but when it doesn't, we fall back on something older, something primal. An eye for an eye existed before courts did."
      },
      "perspective_against": {
        "person": "Mahatma Gandhi",
        "years": "1869-1948",
        "role": "Indian independence leader",
        "quote": "An eye for an eye will only make the whole world blind. Forgiveness is the attribute of the strong. Revenge may satisfy rage momentarily, but it perpetuates the cycle of violence. The murdered cannot be brought back. Revenge does not honor them—it dishonors their memory by creating more victims."
      }
    },
    {
      "id": "question_042",
      "phase": "personal_existential",
      "question": "Religious upbringing - Is it ethical to raise children in a specific religion before they can choose for themselves?",
      "option_a": "Yes, parents should pass on their faith",
      "option_b": "No, let children choose when they're older",
      "perspective_for": {
        "person": "G.K. Chesterton",
        "years": "1874-1936",
        "role": "English writer and Christian apologist",
        "quote": "The real trouble with this world is not that it is an unreasonable world, nor that it is a reasonable one. The commonest kind of trouble is that it is nearly reasonable, but not quite. To tell a child 'decide for yourself when you're older' is to raise them in the religion of relativism. Every parent teaches values. Faith is no different."
      },
      "perspective_against": {
        "person": "Richard Dawkins",
        "years": "1941-present",
        "role": "British evolutionary biologist",
        "quote": "There is no such thing as a Christian child, only a child of Christian parents. It's as absurd as talking about a Keynesian child or a Marxist child. To label children with their parents' religion before they're old enough to understand what it means is a form of mental child abuse. Let them choose when they have reasoning capacity."
      }
    },
    {
      "id": "question_043",
      "phase": "timeless",
      "question": "Preemptive self-defense - You have credible evidence someone plans to kill you. Can you kill them first?",
      "option_a": "Yes, preemptive self-defense is justified",
      "option_b": "No, you must wait until attacked",
      "perspective_for": {
        "person": "Sun Tzu",
        "years": "544-496 BCE (traditional)",
        "role": "Chinese military strategist",
        "quote": "He who knows when he can fight and when he cannot will be victorious. The supreme art of war is to subdue the enemy without fighting. But when you know death approaches, waiting for the blow is foolishness. Strike first. The moral high ground is worthless to a corpse. Prevention is the highest form of defense."
      },
      "perspective_against": {
        "person": "Reinhold Niebuhr",
        "years": "1892-1971",
        "role": "American theologian",
        "quote": "Man's capacity for justice makes democracy possible, but man's inclination to injustice makes democracy necessary. To kill based on mere suspicion, however credible, is to become executioner without trial. The moment we act on what might happen rather than what has happened, we abandon the rule of law for the law of the jungle."
      }
    },
    {
      "id": "question_044",
      "phase": "contemporary",
      "question": "Open borders - Should wealthy nations accept unlimited immigrants from poor countries?",
      "option_a": "Yes, borders are morally arbitrary",
      "option_b": "No, nations must control immigration",
      "perspective_for": {
        "person": "Peter Singer",
        "years": "1946-present",
        "role": "Australian moral philosopher",
        "quote": "From the perspective of the universe, your being born in a wealthy country rather than a poor one is pure luck—morally arbitrary. National borders are lines on a map that have no ethical significance. If we can dramatically improve someone's life by letting them in, and the cost to us is minimal, we are morally obligated to do so."
      },
      "perspective_against": {
        "person": "David Miller",
        "years": "1946-present",
        "role": "British political philosopher",
        "quote": "Nations are not just arbitrary collections of people. They are communities with shared histories, institutions, and obligations to one another. We have special duties to our fellow citizens that we don't have to strangers. Unlimited immigration would destroy the social solidarity that makes welfare states and democracy possible."
      }
    },
    {
      "id": "question_045",
      "phase": "timeless",
      "question": "Jury nullification - As a juror, should you vote 'not guilty' if you think the law itself is unjust, even if the defendant clearly broke it?",
      "option_a": "Yes, nullify unjust laws",
      "option_b": "No, follow the law as written",
      "perspective_for": {
        "person": "Lysander Spooner",
        "years": "1808-1887",
        "role": "American abolitionist and legal theorist",
        "quote": "If the jury have no right to judge of the justice of a law, they plainly can do nothing to protect the people against the tyranny of government. Juries are the palladium of liberty, the last line of defense against oppressive laws. When the law is unjust, the jury must acquit. This is not lawlessness—it is the highest form of law."
      },
      "perspective_against": {
        "person": "Oliver Wendell Holmes Jr.",
        "years": "1841-1935",
        "role": "U.S. Supreme Court Justice",
        "quote": "If the people want to go to hell, I will help them. It's my job. The jury's role is to determine facts, not to make law. If we allow juries to disregard laws they personally dislike, we replace the rule of law with the rule of twelve random citizens. That's mob justice, not justice at all."
      }
    },
    {
      "id": "question_046",
      "phase": "timeless",
      "question": "Designer babies - Should parents be allowed to select embryos for non-medical traits like eye color or intelligence?",
      "option_a": "Yes, parents should choose",
      "option_b": "No, this crosses ethical lines",
      "perspective_for": {
        "person": "Julian Savulescu",
        "years": "1963-present",
        "role": "Australian philosopher and bioethicist",
        "quote": "Parents have not just a right, but a moral obligation to select the best children they can have. If we can give children better lives—healthier, smarter, happier—how can we say no? Concerns about inequality or playing God are sentimental obstacles to genuine human improvement. Evolution is blind; we need not be."
      },
      "perspective_against": {
        "person": "Michael Sandel",
        "years": "1953-present",
        "role": "American political philosopher",
        "quote": "The problem with genetic engineering is that it represents the one-sided triumph of willfulness over giftedness, of dominion over reverence. To appreciate children as gifts is to accept them as they come, not as objects of our design. When we turn procreation into a manufacturing process, we lose something essential about the parent-child relationship."
      }
    },
    {
      "id": "question_047",
      "phase": "timeless",
      "question": "White lies - Your friend asks if their art/performance is good. It isn't. Do you tell them the truth?",
      "option_a": "Yes, tell them honestly it's not good",
      "option_b": "No, lie to preserve their feelings",
      "perspective_for": {
        "person": "Voltaire",
        "years": "1694-1778",
        "role": "French Enlightenment writer",
        "quote": "Perfect is the enemy of good, but dishonesty is the enemy of growth. If you truly respect someone, you tell them the truth. To lie, even kindly, is to treat them as too fragile for reality. Your friend asked for your opinion, not your comfort. Give them what they asked for, or you're no friend at all."
      },
      "perspective_against": {
        "person": "Maya Angelou",
        "years": "1928-2014",
        "role": "American poet and civil rights activist",
        "quote": "I've learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel. Not every truth needs to be spoken. Sometimes encouragement is more valuable than criticism. If the harsh truth serves no constructive purpose, kindness is wiser than honesty."
      }
    },
    {
      "id": "question_048",
      "phase": "timeless",
      "question": "Collective punishment - Is it ever justified to punish a group for the actions of individuals within it?",
      "option_a": "Yes, groups bear collective responsibility",
      "option_b": "No, only individuals should be punished",
      "perspective_for": {
        "person": "Karl Jaspers",
        "years": "1883-1969",
        "role": "German-Swiss psychiatrist and philosopher",
        "quote": "There exists a solidarity among men as human beings that makes each co-responsible for every wrong and every injustice in the world. Germans who did not resist Hitler share in collective guilt. If you remain silent in the face of evil committed by your group, you are complicit. Collective responsibility is real."
      },
      "perspective_against": {
        "person": "Ezekiel (Biblical prophet)",
        "years": "c. 6th century BCE",
        "role": "Hebrew prophet",
        "quote": "The soul who sins shall die. The son shall not suffer for the iniquity of the father, nor the father suffer for the iniquity of the son. The righteousness of the righteous shall be upon himself, and the wickedness of the wicked shall be upon himself. To punish the innocent for the guilty is an abomination."
      }
    },
    {
      "id": "question_049",
      "phase": "personal_existential",
      "question": "Radical life extension - If technology could extend human lifespan to 200+ years, should we pursue it?",
      "option_a": "Yes, extend life as much as possible",
      "option_b": "No, natural lifespan is enough",
      "perspective_for": {
        "person": "Aubrey de Grey",
        "years": "1963-present",
        "role": "English biogerontologist",
        "quote": "Aging is barbaric. It's the world's number one killer and the root cause of untold suffering. The claim that death gives meaning to life is Stockholm syndrome—we've convinced ourselves to love our chains. If we can eliminate aging as a cause of death, we have a moral imperative to do so. More life means more time for love, learning, and creation."
      },
      "perspective_against": {
        "person": "Leon Kass",
        "years": "1939-present",
        "role": "American physician and ethicist",
        "quote": "Mortality is the condition that makes human life precious. Take away death and you take away the urgency that gives life its shape and meaning. An unlimited lifespan would lead to stagnation—why make room for new generations, new ideas, new possibilities? The desire to live forever is really a refusal to accept our human nature."
      }
    },
    {
      "id": "question_050",
      "phase": "timeless",
      "question": "Breaking promises - You promised to keep a secret, but keeping it will let someone be seriously harmed. Do you break your promise?",
      "option_a": "Yes, break the promise to prevent harm",
      "option_b": "No, a promise is sacred",
      "perspective_for": {
        "person": "W.D. Ross",
        "years": "1877-1971",
        "role": "Scottish philosopher",
        "quote": "We have prima facie duties—duties that can be overridden by more pressing moral obligations. The duty to keep promises is strong, but the duty to prevent harm is stronger. When duties conflict, we must weigh them. A promise extracted under false pretenses, or one that leads to grave harm, loses its moral binding force."
      },
      "perspective_against": {
        "person": "Immanuel Kant",
        "years": "1724-1804",
        "role": "German philosopher",
        "quote": "Act only according to that maxim whereby you can at the same time will that it should become a universal law. If everyone broke promises when it seemed convenient, the very institution of promising would collapse. A categorical imperative cannot have exceptions. Your promise is your bond, regardless of consequences."
      }
    },
    {
      "id": "question_051",
      "phase": "contemporary",
      "question": "Cultural appropriation - Is it wrong for people to adopt practices/styles from cultures not their own?",
      "option_a": "Yes, it's disrespectful appropriation",
      "option_b": "No, cultural exchange enriches everyone",
      "perspective_for": {
        "person": "Susan Scafidi",
        "years": "1966-present",
        "role": "American law professor, expert on cultural appropriation",
        "quote": "Taking intellectual property, traditional knowledge, cultural expressions, or artifacts from someone else's culture without permission is appropriation. When you're a member of a dominant culture and you're taking from a marginalized culture, there's a power dynamic. It's particularly harmful when the dominant culture profits from elements it once punished the source culture for practicing."
      },
      "perspective_against": {
        "person": "Kwame Anthony Appiah",
        "years": "1954-present",
        "role": "British-Ghanaian philosopher",
        "quote": "Cultures are made of continuities and changes, and the identity of a society can survive through these changes. The whole human history has been one of cultural mixing. There's no such thing as 'owning' a culture. If cultural appropriation is wrong, then so is all human progress. We are all hybrid creatures—that's what makes us human."
      }
    },
    {
      "id": "question_052",
      "phase": "contemporary",
      "question": "Reparations - Should descendants of those who committed historical atrocities provide compensation to descendants of victims?",
      "option_a": "Yes, justice demands repair",
      "option_b": "No, you can't hold people responsible for their ancestors' actions",
      "perspective_for": {
        "person": "Ta-Nehisi Coates",
        "years": "1975-present",
        "role": "American author and journalist",
        "quote": "What I'm talking about is more than recompense for past injustices—more than a handout, a payoff, hush money, or a reluctant bribe. What I'm talking about is a national reckoning that would lead to spiritual renewal. Reparations would mean the end of scarfing hot dogs on the Fourth of July while denying the facts of our heritage."
      },
      "perspective_against": {
        "person": "Thomas Sowell",
        "years": "1930-present",
        "role": "American economist and social theorist",
        "quote": "The idea that you can transfer guilt across generations, or transfer compensation across generations, is a very dangerous principle. Most of the people who would be taxed today had nothing to do with slavery. Most of the people who would receive reparations had nothing to do with slavery. It's an attempt to right historical wrongs with contemporary injustices."
      }
    },
    {
      "id": "question_053",
      "phase": "timeless",
      "question": "Thought crimes - Should people be punished for their beliefs and thoughts, even if they never act on them?",
      "option_a": "Yes, dangerous thoughts should be corrected",
      "option_b": "No, only actions can be punished",
      "perspective_for": {
        "person": "Catherine MacKinnon",
        "years": "1946-present",
        "role": "American feminist legal scholar",
        "quote": "Pornography is the graphic sexually explicit subordination of women through pictures or words. If this is what you think about women, it affects how you treat them. The thoughts precede and produce the acts. To say that thoughts don't matter is to ignore the causal connection between ideology and action."
      },
      "perspective_against": {
        "person": "John Stuart Mill",
        "years": "1806-1873",
        "role": "British philosopher and political economist",
        "quote": "If all mankind minus one were of one opinion, mankind would be no more justified in silencing that one person than he, if he had the power, would be justified in silencing mankind. The peculiar evil of silencing the expression of an opinion is that it is robbing the human race. We can never be sure that the opinion we are endeavoring to stifle is a false opinion."
      }
    },
    {
      "id": "question_054",
      "phase": "contemporary",
      "question": "Wealth inequality - Should governments forcibly redistribute wealth to reduce inequality?",
      "option_a": "Yes, extreme inequality is unjust",
      "option_b": "No, people are entitled to what they earn",
      "perspective_for": {
        "person": "Thomas Piketty",
        "years": "1971-present",
        "role": "French economist",
        "quote": "When the rate of return on capital exceeds the rate of growth of output and income, capitalism automatically generates arbitrary and unsustainable inequalities that radically undermine the meritocratic values on which democratic societies are based. The entrepreneur inevitably tends to become a rentier, more and more dominant over those who own nothing but their labor."
      },
      "perspective_against": {
        "person": "Robert Nozick",
        "years": "1938-2002",
        "role": "American philosopher",
        "quote": "Whoever makes something, having bought or contracted for all other held resources used in the process, is entitled to it. The situation is not one of something's getting made, and there being an open question of who is to get it. Things come into the world already attached to people having entitlements over them."
      }
    },
    {
      "id": "question_055",
      "phase": "contemporary",
      "question": "Mass surveillance - Should governments have the ability to monitor all communications to prevent terrorism?",
      "option_a": "Yes, security requires surveillance",
      "option_b": "No, privacy is a fundamental right",
      "perspective_for": {
        "person": "Michael Hayden",
        "years": "1945-present",
        "role": "Former Director of NSA and CIA",
        "quote": "We kill people based on metadata. The communications metadata program is a critical tool that we use to protect the nation. The program's exclusive purpose is detecting and preventing terrorist attacks. If you're looking for a needle in the haystack, you need a haystack."
      },
      "perspective_against": {
        "person": "Edward Snowden",
        "years": "1983-present",
        "role": "American whistleblower and privacy advocate",
        "quote": "Arguing that you don't care about the right to privacy because you have nothing to hide is no different than saying you don't care about free speech because you have nothing to say. Privacy isn't about something to hide. Privacy is about something to protect."
      }
    },
    {
      "id": "question_056",
      "phase": "timeless",
      "question": "Animal rights - Do animals have rights comparable to humans?",
      "option_a": "Yes, all sentient beings deserve moral consideration",
      "option_b": "No, humans are fundamentally different",
      "perspective_for": {
        "person": "Peter Singer",
        "years": "1946-present",
        "role": "Australian moral philosopher",
        "quote": "The capacity for suffering and enjoyment is a prerequisite for having interests at all, a condition that must be satisfied before we can speak of interests in a meaningful way. It would be nonsense to say that it was not in the interests of a stone to be kicked along the road by a schoolboy. A stone does not have interests because it cannot suffer. A mouse, on the other hand, does have an interest in not being kicked because it will suffer if it is."
      },
      "perspective_against": {
        "person": "Roger Scruton",
        "years": "1944-2020",
        "role": "British philosopher",
        "quote": "Animals belong to the natural world, and we relate to them as we relate to nature—as stewards and users, not as equals. To attribute rights to animals is to make a category mistake. Rights belong to the realm of justice, which is a relation among free beings who can respect one another's claims. Animals are not moral agents and cannot enter into the community of rights."
      }
    },
    {
      "id": "question_057",
      "phase": "timeless",
      "question": "Free will - If our choices are determined by genetics and environment, should we still punish criminals?",
      "option_a": "No, people aren't truly responsible",
      "option_b": "Yes, punishment serves important social functions",
      "perspective_for": {
        "person": "Sam Harris",
        "years": "1967-present",
        "role": "American neuroscientist and philosopher",
        "quote": "Free will is an illusion. Our wills are simply not of our own making. Thoughts and intentions emerge from background causes of which we are unaware and over which we exert no conscious control. We do not have the freedom we think we have. If we understood that we are not the authors of our own thoughts and actions, we would treat people very differently, especially those who commit crimes."
      },
      "perspective_against": {
        "person": "Daniel Dennett",
        "years": "1942-present",
        "role": "American philosopher and cognitive scientist",
        "quote": "The kind of free will that matters is perfectly compatible with determinism. We are free when our actions flow from our own desires, beliefs, and intentions—even if those were caused by prior events. The question is not whether you could have done otherwise in some absolute sense, but whether you are the kind of being whose actions respond to reasons. Punishment is justified when it helps maintain a system that makes us more responsive to moral reasons."
      }
    },
    {
      "id": "question_058",
      "phase": "contemporary",
      "question": "Hate speech - Should speech that denigrates groups be legally prohibited?",
      "option_a": "Yes, hate speech causes real harm",
      "option_b": "No, free speech must protect even offensive views",
      "perspective_for": {
        "person": "Jeremy Waldron",
        "years": "1953-present",
        "role": "New Zealand legal philosopher",
        "quote": "Hate speech undermines the basic assurance we all need that we are welcome members of society, that we are not outcasts. When someone is publicly degraded on account of their race or religion, they are being told that they are not to be treated as equals. The harm is not just to feelings, but to dignity and to the public good of a society where everyone can participate on equal terms."
      },
      "perspective_against": {
        "person": "Nadine Strossen",
        "years": "1950-present",
        "role": "American legal scholar, former ACLU president",
        "quote": "There is no such thing as a 'hate speech' exception to the First Amendment. And with good reason. Censorship does not reduce discrimination or violence—it often increases it. Who decides what is hateful? The powerful. Throughout history, censorship has been wielded by those in power against dissidents and minorities. The remedy for bad speech is more speech, not censorship."
      }
    },
    {
      "id": "question_059",
      "phase": "contemporary",
      "question": "Drug policy - Should all drugs be legalized and regulated?",
      "option_a": "Yes, prohibition causes more harm than use",
      "option_b": "No, society should prevent self-destructive behavior",
      "perspective_for": {
        "person": "Milton Friedman",
        "years": "1912-2006",
        "role": "American economist",
        "quote": "The role of government is to prevent one person from harming another. It is not the proper role of government to protect people from themselves. Prohibition has led to corruption, violence, and the imprisonment of millions for consensual activities. If you look at the drug war from a purely economic point of view, the role of the government is to protect the drug cartel."
      },
      "perspective_against": {
        "person": "William Bennett",
        "years": "1943-present",
        "role": "American politician and political theorist",
        "quote": "Drugs are wrong because they enslave the mind and destroy the soul. A citizen in a drug-induced haze is not a free man, but a slave to his or her addiction. Society has both the right and duty to protect its members from the scourge of drug addiction. Legalization would be a policy of surrender, sending a message that drug use is acceptable."
      }
    },
    {
      "id": "question_060",
      "phase": "timeless",
      "question": "Ancestral obligation - Do we have moral duties to honor the wishes and traditions of our ancestors?",
      "option_a": "Yes, we owe respect to those who came before",
      "option_b": "No, each generation must forge its own path",
      "perspective_for": {
        "person": "Edmund Burke",
        "years": "1729-1797",
        "role": "Irish-British statesman and philosopher",
        "quote": "Society is a partnership not only between those who are living, but between those who are living, those who are dead, and those who are to be born. The great primeval contract of eternal society is connecting the visible and invisible world. We are not to destroy an edifice which has answered in any tolerable degree the common purposes of society."
      },
      "perspective_against": {
        "person": "Thomas Paine",
        "years": "1737-1809",
        "role": "English-born American political activist and philosopher",
        "quote": "Every age and generation must be as free to act for itself in all cases as the age and generations which preceded it. The vanity and presumption of governing beyond the grave is the most ridiculous and insolent of all tyrannies. I have no idea of being bound by the customs of our forefathers. What right has the dead to say to the living, 'You must continue our way forever'?"
      }
    }
  ]
}
